Revit 2026 API

# CurtainGridAlignType Enumeration

---

An enumerated to list CurtainGrid patterns.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CurtainGridAlignType
```
```vb
Public Enumeration CurtainGridAlignType
```
```cpp
public enum class CurtainGridAlignType
```
```fsharp
type CurtainGridAlignType
```

| Member name | Value | Description |
| --- | --- | --- |
| Beginning | 1 | Beginning pattern of CurtainGrid. |
| Center | 2 | Center pattern of CurtainGrid. |
| End | 3 | End pattern of CurtainGrid. |
| NoJustify | 0 | NoJustify. |

#### Reference

Autodesk.Revit.DB Namespace